from collections import Counter
# Крок 3. Створіть програму, яка приймає список рядків і повертає найчастіші 10 слів у цих рядках, 
# ігноруючи звичайні займенники, прийменники та частки мови.
stop_words = {
    'я', 'ти', 'він', 'вона', 'воно', 'ми', 'ви', 'вони', 'мене', 'тебе', 'нас', 
    'вас', 'його', 'її', 'їх', 'мені', 'тобі', 'йому', 'їй', 'нам', 'вам', 'їм',
    'з', 'до', 'у', 'в', 'на', 'під', 'над', 'біля', 'завдяки', 'про', 'що', 
    'та', 'і', 'але', 'або', 'ні', 'чи', 'як', 'якщо', 'бо', 'тому', 'таким чином'
}

text = input('Enter smth: ').lower().replace('.', '').replace(',', '').split()

cleared = []
for word in text:
    if word in stop_words:
        continue
    else:
        cleared.append(word)

sss = Counter(cleared)

top10 = sss.most_common(10)

print(top10)

