#  \n - перенос рядка

# print('hello \n world')


# \t - табуляція

# print('Name\tAge\tgrade')


# \

# print('\\programming')

# \'

# print("сім'я")

# \f
# print('page1 \f page2')

# \v

# print('qwe\vrty')


s = 'Hello world llo llo'

s = s.replace('llo', '****')
# print(s)

s ='qwerty'

# for i in s:
    # print(i, end= '\t ' * 3)

# Створіть програму, яка приймає від користувача дві строки та порівнює їх лексикографічно (за алфавітом). 
# Виведіть результат порівняння у вигляді логічного значення (True або False).
# s1 = input('enter 1: ')
# s2 = input('enter 2: ')

# res = s1 < s2
# print(f'рядок 1 менше за рядок 2: {res}')




# Створіть програму, яка приймає від користувача дві строки та перетворює 
# їх у список, де перший елемент — це перша літера першої строки, другий 
# елемент — друга літера першої строки, третій елемент — перша літера 
# другої строки, четвертий — друга літера другої строки і т.д. Виведіть цей список.

# s1 = input('enter 1: ')
# s2 = input('enter 2: ')

# l = []

# max_l = max(len(s1), len(s2))  
# # print(max_l)

# for i in range(0,max_l + 1, 2):  
#     if i < len(s1):
#         l.append(s1[i])
#     if i + 1 < len(s1):
#         l.append(s1[i + 1])

#     if i < len(s2):
#         l.append(s2[i])
#     if i + 1 < len(s2):
#         l.append(s2[i + 1])

# print(l)

# .Створіть програму, яка приймає від користувача строку та 
# знаходить кількість слів у цьому рядку (слово — це послідовність символів, 
# розділених пробілами). Виведіть цю кількість.

# s1 = 'lorem ipsum dolores'

# w = s1.split()

# print(len(w))


# Створіть програму, яка приймає від користувача рядок і перевіряє чи є він паліндромом 
# (слово, яке читається однаково зліва направо та справа наліво). Виведіть результат 
# у вигляді логічного значення (True або False).

# s = input('> ')

# new_s = s.replace(' ', '').lower()

# ispal = new_s == new_s[::-1]

# print(f'рядок {s} паліндром? - {ispal}')

