# Напишіть програму, яка дозволяє користувачам реєструватися на сайті та зберігає 
# їх дані у словнику. Ключ — ім'я користувача, а значення — пароль.

login = input('Enter login: ')
password = input('Enter password: ')

user = {login: password}
# user = {}
# user[login] = password
print(user)

# Перетворення рядка у словник. Напишіть програму, яка перетворює рядок
#  у словник, де ключ — перша буква слова, а значення — саме слово. Рядок вводиться користувачем з клавіатури.

sentence = input('Enter smth: ')

words = {sentence[0]: sentence}

words = {}

for i in sentence.split():
    words[i[0]] = i

# words = {i[0]: i for i in sentence.split()}

print(words)


# Гра "Хто є хто". У цій грі користувач повинен відгадати тварину, 
# яку ми загадали. Ми надаємо користувачеві опис цієї тварини, включаючи її колір, розмір,
#  дії і т.д. Користувач повинен ввести свій варіант тварини, а програма повинна повідомити 
# користувачеві, чи він відгадав правильно, чи ні.

import random

animals = {
    'rat': 'small, gray',
    'dog': 'bark, happy',
    'fish': 'quiet, wet'
}
score = 0
while True:
    v = list(animals.values())
    vr = random.choice(v)
    print(f'Here is the discription: {vr}')

    guess = input('Enter animal: ').lower()

    if guess == '0':
        break
    elif score == 4:
        break
    else:
        if guess in animals and animals[guess] == vr:
            score += 1
            print(f'ur score = {score}')
            print('correct')
        else:
            print('incorrect')
            score -= 1
            print(f'ur score = {score}')


user_inp_descr = input('Опис тварини: хижа тварина, переважно травоїдна. Дещо більша за кішку.\nКолір верхньої частини тіла від іржавого до глибокого-каштанового,\nнайтемніший уздовж середини спини. На хвості більш чи менш помітні руді\nкільця. Під очима є темні позначки, в той час, як мордочка, губи, щоки\nта краї вух білі. Задній бік вух, кінцівки та низ від темного,\nчервонувато-коричневого до чорного. Голова округла, вуха великі й\nзагострені, підошви волохаті, кігті напіввтяжні. Самиці мають чотири\nмолочні залози. Нічна й сутінкова тварина, вдень спить на дереві.\nЇжею для неї є: бамбукові паростки, трава, корені, плоди й жолуді.\nТакож іноді вживає комах, яйця, молодих птахів і дрібних гризунів.\nНапишіть свою відповідь: ').lower()
dct = {
    'червона панда': 'Відповідь правильна!',
    'панда червона': 'Відповідь правильна!',
    'мала панда':'Відповідь правильна!',
    'панда мала':'Відповідь правильна!',
    'гімалайська панда':'Відповідь правильна!',
    'панда гімалайська':'Відповідь правильна!',
}
res = dct.get(user_inp_descr, 'Відповідь не правильна(')
print(res)


# Напишіть програму, яка приймає від користувача 
# список з імен та оцінок, та обчислює середній бал для кожного учня. 
# Результат виводиться у вигляді словника, де ключ — ім'я учня, а значення — середній бал.

name = input('Enter name: ')
grades = input('Enter grades: ').split()

# average = sum(int(i) for i in grades) / len(grades)
summa = 0
for i in grades:
    summa += int(i)
average = summa / len(grades)

student = {name: round(average)}

print(student)

# Напишіть програму, яка дозволяє користувачу зберігати інформацію про товари у 
# словник. Ключ — назва товару, а значення — ціна та кількість одиниць на складі. 
# Програма повинна мати наступні опції: ✅ Додати новий товар ✅ Видалити товар ✅ Змінити ціну або кількість товару
#  ✅ Переглянути список всіх товарів та їх характеристик

tovarName = input('Enter tovar: ')

price = float(input('Enter price: '))
amount = int(input('Enter kilkist: '))

goods = {}

goods[tovarName] = {'price': price,
                    'amount': amount}

print(goods)